In [2]:
family={
    "first":["laxmi","mahesh","sheshnath","sunil"],
    "last":["bhandari","bhandari","bhandari","bhandar"],
    "email":["lx@gmail.com","ma@gmail.com","sh@gmail.com","su@gmail.com"]
}

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame(family)

In [5]:
df

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [6]:
type[df["email"]]

type[0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object]

In [7]:
df.email

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [8]:
df['email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [9]:
df[['first','last',"email"]]

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[0]

first           laxmi
last         bhandari
email    lx@gmail.com
Name: 0, dtype: object

In [12]:
df.iloc[[0,1],0]

0     laxmi
1    mahesh
Name: first, dtype: object

In [13]:
df.loc[[0,1],"first"]

0     laxmi
1    mahesh
Name: first, dtype: object

In [14]:
df.set_index('email')

                  first      last
email
lx@gmail.com      laxmi  bhandari
ma@gmail.com     mahesh  bhandari
sh@gmail.com  sheshnath  bhandari
su@gmail.com      sunil   bhandar

In [15]:
df

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [16]:
df.set_index('email',inplace=True)

In [17]:
df

                  first      last
email
lx@gmail.com      laxmi  bhandari
ma@gmail.com     mahesh  bhandari
sh@gmail.com  sheshnath  bhandari
su@gmail.com      sunil   bhandar

In [18]:
df.loc['su@gmail.com','last']

'bhandar'

In [19]:
df.loc['lx@gmail.com']

first       laxmi
last     bhandari
Name: lx@gmail.com, dtype: object

In [20]:
df.iloc[0]

first       laxmi
last     bhandari
Name: lx@gmail.com, dtype: object

In [21]:
df.reset_index(inplace=True)

In [22]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [23]:

#now using flitering the data to use what we want.

In [24]:
df['last']=='bhandari'

0     True
1     True
2     True
3    False
Name: last, dtype: bool

In [25]:
#here it returns only the boolen value so it is difficult for us to see,know so we use filter.

In [26]:
filt=(df['last']=='bhandari')

In [27]:
df[filt]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [28]:
#or we can write it as follow
df.loc[filt]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [29]:
#we can run it as follow also
df[df['last']=="bhandari"]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [30]:
#reson of perfering loc is that we can grab specific columns that we want as well

In [31]:
df.loc[filt,'email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
Name: email, dtype: object

In [32]:
#like in other langauge we can use operators here to filter thegiven data/.

In [33]:
filt=(df['last']=='bhandari')&(df['first']=='laxmi')

In [34]:
df.loc[filt,'email']

0    lx@gmail.com
Name: email, dtype: object

In [35]:
filt=(df['last']=="bhandari")|(df['last']=='bhandar')

In [36]:
df.loc[filt,'email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [37]:
filt=(df['last']=='bhandari')&(df['first']=='laxmi')

In [38]:
df.loc[~filt,"email"]

1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [39]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [40]:
#updating the rows and columns
#modifying data with in the dataframe

In [41]:
#updating column first
#multiple rows

In [42]:
df.columns=['email','first_name','last_name']
#it will change the name of the columns

In [43]:
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [44]:
#using list comprensive

In [45]:
df.columns=[x.upper() for x in df.columns]
#it will change the column name into uppercase

In [46]:
df

          EMAIL FIRST_NAME LAST_NAME
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [47]:
df.columns=[x.lower() for x in df.columns]
#it will again change the column in the lower case

In [48]:
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [49]:
df.columns=df.columns.str.replace('_',' ')
#it will change every _ in space in the column as shown above

In [50]:
df

          email first name last name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [51]:
df.columns=df.columns.str.replace(' ','_')
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [52]:
#changing some columns
#here the dictionary comes in the picture

In [53]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [54]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [55]:
#changing or updating the rows
#firstly changing the multiple rows

In [56]:
df.loc[2]

email    sh@gmail.com
first       sheshnath
last         bhandari
Name: 2, dtype: object

In [57]:
df.loc[2]=['SN@gmail.com','SN','Bhandari']

In [58]:
df

          email   first      last
0  lx@gmail.com   laxmi  bhandari
1  ma@gmail.com  mahesh  bhandari
2  SN@gmail.com      SN  Bhandari
3  su@gmail.com   sunil   bhandar

In [59]:
#df.loc[2]=['Sh@gmail.com',"sn"]

In [60]:
#NOTE

In [61]:
#df.loc[2]=['SN@gmail.com','SN','Bhandari']
#IF we use this to change the rfows and i we have to change one word but there are multiple rows than it really SUCKS.
#So we usethe following Insted

In [62]:
df.loc[2,['first','email']] = ['Sheshnath','sh@gmail.com']

In [63]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  Sheshnath  Bhandari
3  su@gmail.com      sunil   bhandar

In [64]:
#changing the one word in the row

In [65]:
df.loc[2,'first']='sheshnath'

In [66]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  Bhandari
3  su@gmail.com      sunil   bhandar

In [67]:
#.at is similar to .loc

In [68]:
df.at[2,'last']='bhandari'

In [69]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [70]:
#changing the multiple ROW

In [71]:
df['email'].str.lower()

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [72]:
df['email'].str.upper()

0    LX@GMAIL.COM
1    MA@GMAIL.COM
2    SH@GMAIL.COM
3    SU@GMAIL.COM
Name: email, dtype: object

In [73]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [74]:
df['email']=df['email'].str.upper()

In [75]:
df

          email      first      last
0  LX@GMAIL.COM      laxmi  bhandari
1  MA@GMAIL.COM     mahesh  bhandari
2  SH@GMAIL.COM  sheshnath  bhandari
3  SU@GMAIL.COM      sunil   bhandar

In [76]:
df

          email      first      last
0  LX@GMAIL.COM      laxmi  bhandari
1  MA@GMAIL.COM     mahesh  bhandari
2  SH@GMAIL.COM  sheshnath  bhandari
3  SU@GMAIL.COM      sunil   bhandar

In [77]:
#there are 4 method to change rows and they are
#apply
#map
#applymap
#replace

In [78]:
#APPLY
#used for calling a function on our value
#it can work in data frame and on series both.

In [79]:
#how apply works on series

In [80]:
df['email'].apply(len)

0    12
1    12
2    12
3    12
Name: email, dtype: int64

In [81]:
#creating the function and calling that function

In [82]:
def update_email (email):
    return email.lower()

In [83]:
df['email']=df['email'].apply(update_email)

In [84]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [85]:
#how apply works on dataframe

In [86]:
df.apply(len)

email    4
first    4
last     4
dtype: int64

In [87]:
df.apply(len,axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [88]:
df.apply(pd.Series.min)

email    lx@gmail.com
first           laxmi
last          bhandar
dtype: object

In [89]:
# APPLY MAPS

In [90]:
#APPLY MAP only works on dataframe

In [91]:
df.applymap(len)

   email  first  last
0     12      5     8
1     12      6     8
2     12      9     8
3     12      5     7

In [92]:
df.applymap(str.upper)

          email      first      last
0  LX@GMAIL.COM      LAXMI  BHANDARI
1  MA@GMAIL.COM     MAHESH  BHANDARI
2  SH@GMAIL.COM  SHESHNATH  BHANDARI
3  SU@GMAIL.COM      SUNIL   BHANDAR

In [93]:
df.applymap(str.lower)

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [94]:
#MAP

In [95]:
#map is used to substitute each values in a series with another value.
#here the dictionary comes into the picture.

In [96]:
df['first'].map({'sunil':'men'})

0    NaN
1    NaN
2    NaN
3    men
Name: first, dtype: object

In [97]:
#the drawback of using map is that if we donot change the any word it will not be viewed same,
#rather  it will show NaN

In [98]:
#so REPLACE comes into the picture.

In [99]:
#REPLACE

In [100]:
df['first'].replace({'men':'sunil'})

0        laxmi
1       mahesh
2    sheshnath
3        sunil
Name: first, dtype: object

In [101]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [102]:
#Add and remove rows and columns from dataframe

In [103]:
#for columns
#combining columns

In [104]:
df['first']+' '+df['last']

0        laxmi bhandari
1       mahesh bhandari
2    sheshnath bhandari
3         sunil bhandar
dtype: object

In [105]:
#Adding Columns

In [106]:
df['Full_name']=df['first']+' '+df['last']

In [107]:
df

          email      first      last           Full_name
0  lx@gmail.com      laxmi  bhandari      laxmi bhandari
1  ma@gmail.com     mahesh  bhandari     mahesh bhandari
2  sh@gmail.com  sheshnath  bhandari  sheshnath bhandari
3  su@gmail.com      sunil   bhandar       sunil bhandar

In [108]:
#removing columns
#drop is used to remove.

In [109]:
df.drop(columns=['first','last'],inplace=True)

In [110]:
df

          email           Full_name
0  lx@gmail.com      laxmi bhandari
1  ma@gmail.com     mahesh bhandari
2  sh@gmail.com  sheshnath bhandari
3  su@gmail.com       sunil bhandar

In [111]:
#string split

In [112]:
df['Full_name'].str.split(' ')

0        [laxmi, bhandari]
1       [mahesh, bhandari]
2    [sheshnath, bhandari]
3         [sunil, bhandar]
Name: Full_name, dtype: object

In [113]:
df['Full_name'].str.split(' ',expand=True)

           0         1
0      laxmi  bhandari
1     mahesh  bhandari
2  sheshnath  bhandari
3      sunil   bhandar

In [114]:
df[['first','last']]=df['Full_name'].str.split(' ',expand=True)

In [115]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar

In [116]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar

In [117]:
#now its turn for rows
#adding single rows
#for adding the single rows the concat is used 
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar

In [118]:
df.append({'Full_name':'Neymar Jr'},ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_3676\3701847585.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'Full_name':'Neymar Jr'},ignore_index=True)

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4           NaN           Neymar Jr        NaN       NaN

In [119]:
#Modifying dataframe

In [120]:
#creating an another dictionary

In [121]:
people={
    'first':['Mice',"Jerry"],
    'last':['Trump','Hennry'],
    'email':['m@gmail.com','J@gmail.com']
}

In [122]:
df2=pd.DataFrame(people)

In [123]:
df2

   first    last        email
0   Mice   Trump  m@gmail.com
1  Jerry  Hennry  J@gmail.com

In [124]:
#combining or appending the dataframe

In [125]:
df.append(df2,ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_3676\2741153526.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True)

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4   m@gmail.com                 NaN       Mice     Trump
5   J@gmail.com                 NaN      Jerry    Hennry

In [126]:
#here inplace cannot be used so

In [127]:
df=df.append(df2,ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_3676\2482205262.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True)

In [128]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4   m@gmail.com                 NaN       Mice     Trump
5   J@gmail.com                 NaN      Jerry    Hennry

In [129]:
#Removinf the rows
#drop is used to remove the rows

In [130]:
#df.drop(index=5)

In [133]:
#SORTING DATA

df.sort_value(by='last')

In [134]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4   m@gmail.com                 NaN       Mice     Trump
5   J@gmail.com                 NaN      Jerry    Hennry

In [135]:
#sorting the according to the need that may be assending or deacending

In [141]:
df.sort_values(by='last',ascending=True)

          email           Full_name      first      last
5   J@gmail.com                 NaN      Jerry    Hennry
4   m@gmail.com                 NaN       Mice     Trump
3  su@gmail.com       sunil bhandar      sunil   bhandar
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari

In [142]:
#sorting in multiple columns

In [144]:
df.sort_values(by=['last','first'],ascending=False)

          email           Full_name      first      last
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4   m@gmail.com                 NaN       Mice     Trump
5   J@gmail.com                 NaN      Jerry    Hennry

In [145]:
#sorting in multiple columns on in ascending order and other in descending order or vice-verca

In [147]:
df.sort_values(by=['last','first'],ascending=[True,False])

          email           Full_name      first      last
5   J@gmail.com                 NaN      Jerry    Hennry
4   m@gmail.com                 NaN       Mice     Trump
3  su@gmail.com       sunil bhandar      sunil   bhandar
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari

In [148]:
df.sort_index()

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar
4   m@gmail.com                 NaN       Mice     Trump
5   J@gmail.com                 NaN      Jerry    Hennry